prestashop/modules/correos/request.xml

<?xml version="1.0"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns="http://www.correos.es/iris6/services/preregistroetiquetas">
  <soapenv:Body>
    <PreregistroEnvio>
      <FechaOperacion>13-07-2018 11:10:27</FechaOperacion>
      <CodEtiquetador>43B4</CodEtiquetador>
      <ModDevEtiqueta>2</ModDevEtiqueta>
      <Care>000000</Care>
      <TotalBultos>1</TotalBultos>
      <Remitente>
        <Identificacion>
          <Nombre>Correos</Nombre>
          <Apellido1>Prestashop</Apellido1>
          <Nif>12345678Z</Nif>
          <Empresa>Correos</Empresa>
          <PersonaContacto>Correos</PersonaContacto>
        </Identificacion>
        <DatosDireccion>
          <Direccion>Via Dublin 7</Direccion>
          <Localidad>Madrid</Localidad>
          <Provincia>Madrid</Provincia>
        </DatosDireccion>
        <CP>28042</CP>
        <Telefonocontacto>678678678</Telefonocontacto>
        <DatosSMS>
          <Idioma>1</Idioma>
        </DatosSMS>
      </Remitente>
      <Destinatario>
        <Identificacion>
          <Nombre>HGFF</Nombre>
          <Apellido1>HGFGH</Apellido1>
        </Identificacion>
        <DatosDireccion>
          <Direccion>erere</Direccion>
          <Localidad>lisboa</Localidad>
        </DatosDireccion>
        <ZIP>2670-362</ZIP>
        <Pais>PT</Pais>
        <Email>ventaspaqueteria@correos.com</Email>
      </Destinatario>
      <Envio>
        <CodProducto>S0360</CodProducto>
        <ReferenciaCliente>92 QRHYLATLM</ReferenciaCliente>
        <TipoFranqueo>FP</TipoFranqueo>
        <ModalidadEntrega>ST</ModalidadEntrega>
        <Pesos>
          <Peso>
            <TipoPeso>R</TipoPeso>
            <Valor>2000</Valor>
          </Peso>
        </Pesos>
        <Largo>0</Largo>
        <Alto>0</Alto>
        <Ancho>0</Ancho>
        <Aduana>
          <TipoEnvio>2</TipoEnvio>
          <EnvioComercial>S</EnvioComercial>
          <FacturaSuperiora500>N</FacturaSuperiora500>
          <DUAConCorreos>N</DUAConCorreos>
          <DescAduanera>
            <DATOSADUANA>
              <Cantidad>1</Cantidad>
              <Descripcion>24</Descripcion>
              <Pesoneto>1000</Pesoneto>
              <Valorneto>001600</Valorneto>
            </DATOSADUANA>
          </DescAduanera>
        </Aduana>
        <InstruccionesDevolucion>D</InstruccionesDevolucion>
      </Envio>
    </PreregistroEnvio>
  </soapenv:Body>
</soapenv:Envelope>
